{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "sequential_21", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 512, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_15_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_21", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_22", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_16_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_22", "inbound_nodes": [[["sequential_21", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_23", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_17_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_23", "inbound_nodes": [[["sequential_22", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_24", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_18_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_24", "inbound_nodes": [[["sequential_23", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_25", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_19_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_25", "inbound_nodes": [[["sequential_24", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_26", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_20_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_26", "inbound_nodes": [[["sequential_25", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_27", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_21_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_27", "inbound_nodes": [[["sequential_26", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_28", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_22_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_28", "inbound_nodes": [[["sequential_27", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_29", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 2, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_23_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_29", "inbound_nodes": [[["sequential_28", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_30", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_9_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_9", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_30", "inbound_nodes": [[["sequential_29", 1, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_9", "inbound_nodes": [[["sequential_30", 1, 0, {}], ["sequential_28", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_31", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 2, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_10_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_10", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_29", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_9", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_31", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_10", "inbound_nodes": [[["sequential_31", 1, 0, {}], ["sequential_27", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_32", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_11_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_11", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_30", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_32", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_11", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_11", "inbound_nodes": [[["sequential_32", 1, 0, {}], ["sequential_26", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_33", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_12_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_12", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_31", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_11", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_33", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_12", "inbound_nodes": [[["sequential_33", 1, 0, {}], ["sequential_25", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_34", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_13_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_13", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_32", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_12", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_34", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_13", "inbound_nodes": [[["sequential_34", 1, 0, {}], ["sequential_24", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_35", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 768], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_14_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_14", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_33", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_13", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_35", "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_14", "inbound_nodes": [[["sequential_35", 1, 0, {}], ["sequential_23", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_36", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 384], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_15_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_34", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_36", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_15", "inbound_nodes": [[["sequential_36", 1, 0, {}], ["sequential_22", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_37", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 192], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_transpose_16_input"}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_16", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_35", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_37", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_16", "inbound_nodes": [[["sequential_37", 1, 0, {}], ["sequential_21", 1, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "tensorflow.python.ops.init_ops_v2", "class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}, "registered_name": "RandomNormal"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_17", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_transpose_17", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_transpose_17/kernel", "shape": [4, 4, 3, 96], "dtype": "float32"}, {"name": "conv2d_transpose_17/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "batch_normalization_20/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "batch_normalization_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "batch_normalization_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_23/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_24/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_25/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_22/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_26/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_27/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_9/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_28/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_28/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_28/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_28/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_10/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "batch_normalization_29/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_29/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_11/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "batch_normalization_30/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_30/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_30/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_30/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_12/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "batch_normalization_31/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_31/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_13/kernel", "shape": [4, 4, 256, 1024], "dtype": "float32"}, {"name": "batch_normalization_32/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_32/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_14/kernel", "shape": [4, 4, 128, 768], "dtype": "float32"}, {"name": "batch_normalization_33/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_33/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_15/kernel", "shape": [4, 4, 64, 384], "dtype": "float32"}, {"name": "batch_normalization_34/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_34/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_16/kernel", "shape": [4, 4, 32, 192], "dtype": "float32"}, {"name": "batch_normalization_35/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_35/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_35/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_35/moving_variance", "shape": [32], "dtype": "float32"}]}]}